---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.IPipePressureDropServer.GetInformationLink
source: html/8cbc4b35-bd71-3172-c993-8f3eb8b22f66.htm
---
# Autodesk.Revit.DB.Plumbing.IPipePressureDropServer.GetInformationLink Method

The method that Revit will invoke to obtain a URL address which provides more information about the server.

## Syntax (C#)
```csharp
string GetInformationLink()
```

## Returns
The URL providing server information.